#+TITLE: Epoch
#+DATE: <1970-01-01 qui>


* Heading 1
** Heading 2
*** Heading 3

* Text
/Italic/ *Bold* _underline_ =Verbatim= +strikethrough+

* Lists

Unorganized
- a
  - b
  - c
- d

Organized
1. a
   2. b
   3. c
2. d
   
* Quotes

#+begin_quote
"The strength of JavaScript is that you can do anything. The weakness is that you will."\\
--- Reg Braithwaite
#+end_quote

#+begin_quote
**TEST**

"The strength of JavaScript is that you can do anything. The weakness is that you will."\\
--- Reg Braithwaite
#+end_quote

* Tables

| Item         | Peso  | Valor (R$) |
|--------------+-------+------------|
| Pera         | 1Kg   |         28 |
| Uva          | 500g  |         12 |
| Maçã         | 1Kg   |         19 |
| Salada mista | 150g  |         10 |
|--------------+-------+------------|
|              | *Total* |      69 R$ |
#+TBLFM: @>$3=string("R$")vsum(@I..@II)

* Source code
#+begin_src simphare
use fmt;

export fn main() void = {
	const greetings = [
		"Hello, world!",
		"¡Hola Mundo!",
		"Γειά σου Κόσμε!",
		"Привіт, світе!",
		"こんにちは世界！",
	];
	for (let greeting .. greetings) {
		fmt::println(greeting)!;
	};
};
#+end_src

#+begin_src C
#include <stdio.h>

int main(void) {
  printf("Hello, World!\n");
  return 0
}
#+end_src

#+begin_src emacs-lisp :eval yes :exports both
(message "Hello, World!")
#+end_src

